{"class_name": "Model", "config": {"name": "model_6", "layers": [{"name": "input_15", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 6], "dtype": "int32", "sparse": false, "name": "input_15"}, "inbound_nodes": []}, {"name": "embedding_12", "class_name": "Embedding", "config": {"name": "embedding_12", "trainable": false, "batch_input_shape": [null, 6], "dtype": "float32", "input_dim": 43999, "output_dim": 300, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 6}, "inbound_nodes": [[["input_15", 0, 0, {}]]]}, {"name": "bidirectional_11", "class_name": "Bidirectional", "config": {"name": "bidirectional_11", "trainable": true, "layer": {"class_name": "GRU", "config": {"name": "gru_11", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 64, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1, "reset_after": false}}, "merge_mode": "concat"}, "inbound_nodes": [[["embedding_12", 0, 0, {}]]]}, {"name": "attention_11", "class_name": "Attention", "config": {"name": "attention_11", "trainable": true}, "inbound_nodes": [[["bidirectional_11", 0, 0, {}]]]}, {"name": "dense_7", "class_name": "Dense", "config": {"name": "dense_7", "trainable": true, "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["attention_11", 0, 0, {}]]]}], "input_layers": [["input_15", 0, 0]], "output_layers": [["dense_7", 0, 0]]}, "keras_version": "2.2.0", "backend": "theano"}